Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: $ echo "Ich bin klüger als mein Chef" > meinedatei.txt $ git init $ git add .
pl: $ echo "jestem mądrzejszy od szefa" > mojplik.txt $ git init $ git add .

source: $ echo sweet > DEIN_DATEINAME $ git init $ git add .
pl: $ echo sweet > TWOJA_NAZWA $ git init $ git add .

source: $ edit intro.txt # übersetze diese Datei.
pl: $ edit intro.txt # Przetłumacz ten plik.

source: $ find .git/objects -type f
pl: $ find .git/objects -type f $ find .git/objects -type f

source: $ git apply < mein.patch
pl: $ git apply < moj.patch

source: $ git bisect run mein_skript
pl: $ git bisect run moj_skrypt

source: $ git branch -D dead_branch # instead of -d
pl: $ git branch -D dead_branch # zamiast -d

source: $ git branch -M source target # instead of -m
pl: git branch -M zrodlo cel # zamiast -m

source: $ git branch -m master teil2 # Umbenennen des 'Branch' "master" zu "teil2".
pl: $ git branch -m master czesc2 # zmiana nazwy 'branch' "master" na "czesc2".

source: $ git branch master HEAD~7 # Erstelle neuen "master", 7 Commits voraus
pl: $ git branch master HEAD~7 # utwórz nowy "master", 7 'commit' do przodu

source: $ git bundle create einedatei HEAD
pl: $ git bundle create plik HEAD

source: $ git bundle create einedatei HEAD ^1b6d
pl: $ git bundle create plik HEAD ^1b6d

source: $ git bundle create neuesbundle HEAD ^letztesbundle
pl: $ git bundle create nowybundle HEAD ^ostatnibundle

source: $ git checkout -b chef # scheinbar hat sich danach nichts geändert $ echo "Mein Chef ist klüger als ich" > meinedatei.txt $ git commit -a -m "Ein anderer Stand"
pl: $ git checkout -b chef # wydaje się, że nic nie uległo zmianie $ echo "Mój szef jest mądrzejszy ode mnie" > mojplik.txt $ git commit -a -m "Inny stan"

source: $ git checkout -b schmutzig
pl: $ git checkout -b brudy

source: $ git checkout -b teil2
pl: $ git checkout -b czesc2

source: $ git checkout 1b6d^^2~10 -b uralt
pl: $ git checkout 1b6d^^2~10 -b archaiczny

source: $ git checkout chef # wechsle zur Version die der Chef ruhig sehen kann
pl: $ git checkout chef # wersja, którą szef spokojnie może zobaczyć

source: $ git checkout master # Gehe zurück zu Teil I. $ fix_problem $ git commit -a # 'Commite' die Lösung.
pl: $ git checkout master # wróć do częsci I $ usun_problem $ git commit -a # wykonaj 'commit' z rozwiązaniam.

source: $ git checkout master # Gehe zurück zu Teil I. $ submit files # Veröffentliche deine Dateien!
pl: $ git checkout master # Idź do części I. $ submit files # Opublikuj dane!

source: $ git checkout master # wechsle zur Originalversion der Datei
pl: $ git checkout master # przejdź do wersji orginalnej

source: $ git checkout schnmutzig
pl: $ git checkout brudy

source: $ git checkout teil2 # Gehe zurück zu Teil II. $ git merge master # 'Merge' die Lösung.
pl: $ git checkout czesc2 # Idź do części II. $ git merge master # 'merge' rozwiązanie.

source: $ git clone git://repo.or.cz/gitmagic.git # Erstellt "gitmagic" Verzeichnis.
pl: $ git clone git://repo.or.cz/gitmagic.git # Utworzy katalog "gitmagic".

source: $ git clone git://repo.or.cz/gitmagic.git $ cd gitmagic $ mkdir tlh # "tlh" ist das IETF Sprachkürzel für Klingonisch.
pl: $ git clone git://repo.or.cz/gitmagic.git $ cd gitmagic $ mkdir tlh # "tlh" jest skrótem IETF języka Klingonisch.

source: $ git commit # Schreibe eine Bemerkung.
pl: $ git commit # dodaj jakiś opis.

source: $ git commit --amend -m Shakespeare # Ändere die Bemerkung.
pl: $ git commit --amend -m Shakespeare # Zmień ten opis.

source: $ git commit -a -m "Fehler behoben" $ git checkout master
pl: $ git commit -a -m "usunięto bug" $ git checkout master

source: $ git commit -m "Erster Stand"
pl: $ git commit -m "pierwszy stan"

source: $ git config --global user.name "Max Mustermann" $ git config --global user.email maxmustermann@beispiel.de
pl: $ git config --global user.name "Jan Kowalski" $ git config --global user.email jan.kowalski@example.com

source: $ git config remote.origin.url git://neue.url/proj.git
pl: git config remote.origin.url git://nowy_link/proj.git

source: $ git diff 1b6d > mein.patch
pl: $ git diff 1b6d > moj.patch

source: $ git diff origin/experimentell^ other/some_branch~5
pl: $ git diff origin/experimental^ inny/jakis_branch~5

source: $ git fetch # Fetch vom origin, der Standard.
pl: $ git fetch # Fetch z origin, jako standard.

source: $ git fetch other # Fetch vom zweiten Programmierer.
pl: $ git fetch inne # Fetch od drugiego programisty.

source: $ git filter-branch --env-filter 'export GIT_AUTHOR_DATE="Fri 13 Feb 2009 15:31:30 -0800" GIT_AUTHOR_NAME="Alice" GIT_AUTHOR_EMAIL="alice@example.com" GIT_COMMITTER_DATE="Fri, 13 Feb 2009 15:31:30 -0800" GIT_COMMITTER_NAME="Bob" GIT_COMMITTER_EMAIL="bob@example.com"' # Manipuliere Zeitstempel und Autor.
pl: $ git filter-branch --env-filter 'export GIT_AUTHOR_DATE="Fri 13 Feb 2009 15:31:30 -0800" GIT_AUTHOR_NAME="Alice" GIT_AUTHOR_EMAIL="alice@example.com" GIT_COMMITTER_DATE="Fri, 13 Feb 2009 15:31:30 -0800" GIT_COMMITTER_NAME="Bob" GIT_COMMITTER_EMAIL="bob@example.com"' # Zmanipuluj znacznik czasowy i nazwę autora.

source: $ git filter-branch --tree-filter 'mv DEIN_DATEINAME rose' $ find .git/objects -type f
pl: $ git filter-branch --tree-filter 'mv TWOJA_NAZWA rose' $ find .git/objects -type f

source: $ git filter-branch --tree-filter 'rm sehr/geheime/Datei' HEAD
pl: $ git filter-branch --tree-filter 'rm bardzo/tajny/plik' HEAD

source: $ git log origin/experimentell
pl: $ git log origin/experimental

source: $ git merge teil2 # 'Merge' in Teil II. $ git branch -d teil2 # Lösche den Branch "teil2"
pl: $ git merge czesc2 # 'merge' w części II. $ git branch -d czesc2 # Usuń 'branch' o nazwie "czesc2"

source: $ git pull einedatei
pl: $ git pull plik

source: $ git pull git://beispiel.com/anderes.git master
pl: $ git pull git://example.com/inny.git master

source: $ git push web.server:/pfad/zu/proj.git master
pl: $ git push web.server:/sciezka/do/proj.git master

source: $ git remote add other git://example.com/some_repo.git $ git pull other some_branch
pl: $ git remote add inny git://example.com/jakies_repo.git $ git pull inny jakis_branch

source: $ git tag -f letztesbundle HEAD
pl: $ git tag -f ostatnibundle HEAD

source: $ git-new-workdir ein/existierendes/repo neues/verzeichnis
pl: $ git-new-workdir ein/istniejacy/repo nowy/katalog

source: 'Branch'-Magie
pl: Magia 'branch'

source: 'Branchen' ist wie Tabs für dein Arbeitsverzeichnis und 'Clonen' ist wie das Öffnen eines neuen Browserfenster.
pl: BRANCHEN to jak tabs dla twojego katalogu roboczego a CLONEN porównać można do otwarcia wielu okien.

source: 'Branches' sind fast das selbe: sie sind Dateien in +.git/refs/heads+.
pl: 'branches' to prawie to samo, są plikami zapamiętanymi w +.git/refs/heads+.

source: 'Branches' verwalten
pl: Organizacja BRANCHES

source: 'Clone' die Quelltexte, dann erstelle ein Verzeichnis mit dem Namen des IETF Sprachkürzel der übersetzten Sprache: siehe http://www.w3.org/International/articles/language-tags/Overview.en.php[den W3C Artikel über Internationalisierung].
pl: 'Clone' texty źródłowe, następnie utwórz katalog o nazwie skrótu IETF przetłumaszonego języka: sprawdź http://www.w3.org/International/articles/language-tags/Overview.en.php[Artykół W3C o internacjonalizacji].

source: 'Clonen', 'Branchen' und 'Mergen' sind unmöglich ohne Netzwerkverbindung.
pl: Polecenia 'clone', 'branche' czy 'merge' nie są możliwe bez podłączenia do sieci.

source: 'Commite' Änderungen
pl: Zmiany 'commit'

source: 'Commits' sind elementar, das heißt, ein 'Commit' kann niemals nur Teile einer Änderung speichern: wir können den SHA1-Hash-Wert eines 'Commits' erst dann berechnen und speichern, nachdem wir bereits alle relevanten 'Tree'-Objekte, 'Blob'-Objekte und Eltern-'Commits' gespeichert haben.
pl: 'commits' są elementarne, do znaczy, 'commit' nie potrafi zapamiętać jedynie części zmian: klucz SHA1 'commit' możemy obliczyć i zapamiętać dopiero po tym gdy zapamiętane zostały wszystkie objekty 'tree', 'blob' i rodziców 'commit'.

source: 'Committe' deine Änderungen oft und wenn du fertig bist, gib bitte Bescheid.
pl: Używaj często 'commit' a gdy już skończysz, to daj znać.

source: 'Fork' eines Projekts
pl: FORK projektu

source: 'Merge' Konflikte
pl: Konflikty z 'merge'

source: 'Mergen'
pl: 'merge'

source: 'Nackte Repositories'
pl: Gołe REPOSITORIES

source: 'Patches' sind die Klartextdarstellung Deiner Änderungen, die von Computern und Menschen gleichermaßen einfach verstanden werden.
pl: 'Patches' to jawne zobrazowanie twoich zmian, które mogą być jednocześnie rozumiane przez komputer i człowieka.

source: 'Push' oder 'Pull'
pl: PUSH albo PULL

source: 'Speedruns' sind Beispiele aus dem echten Leben: Spieler, die sich in unterschiedlichen Spielebenen des selben Spiels spezialisiert haben, arbeiten zusammen um erstaunliche Ergebnisse zu erzielen.
pl: 'Speedruns' mogą posłużyć jako przykład z prawdziwego życia: gracze, którzy wyspecjalizowali się w różnych poziomach gry współpracują ze sobą dla uzyskania fascynujących wyników.

source: 'Tags' ebenso: sie stehen in +.git/refs/tags+ aber sie werden durch einen Satz anderer Anweisungen aktualisiert.
pl: 'Tags' również, znajdziemy je w +.git/refs/tags+, są one jednak aktualizowane poprzez serię innych poleceń.

source: * `fixup` um einen 'Commit' mit dem vorhergehenden zu vereinen ('merge') und die Log-Beschreibung zu verwerfen.
pl: * `fixup` by połączyć 'commit' z poprzednim ('merge') i usunąć zapisy z logu.

source: * `reword` um die Log-Beschreibung zu ändern.
pl: * `reword`, by zmienić opisy logu.

source: * `squash` um einen 'Commit' mit dem vorhergehenden zu vereinen ('merge').
pl: * `squash` by połączyć 'commit' z poprzednim ('merge').

source: *Branch*: 'Branches' zu löschen scheitert ebenfalls, wenn dadurch Änderungen verloren gehen.
pl: *Branch*: Skasowanie 'branches' też się nie powiedzie, jeśli mogłyby przez to zostać utracone zmiany.

source: *Checkout*: Nicht versionierte Änderungen lassen 'checkout' scheitern.
pl: *Checkout*: nie wersjonowane zmiany doprowadzą do niepowodzenia polecenia 'checkout'.

source: *Clean*: Verschiedene git Anweisungen scheitern, weil sie Konflikte mit unversionierten Dateien vermuten.
pl: *clean*: różnorakie polecenia git nie chcą się powieźć, ponieważ podejżewają konflikty z niewersjonowanymi danymi.

source: *Lösung*: Git hat ein besseres Werkzeug für diese Situationen, die wesentlich schneller und platzsparender als 'clonen' ist: *git branch*.
pl: *Rozwiazanie*: Git posiada lepsze narzedzia dla takich sytuacji, ktore sa duzo szybsze i oszczedniejsze dla miejsca na dysku jak klonowanie jest: *git branch*.

source: *Problem*: Externe Faktoren zwingen zum Wechsel des Kontext.
pl: *Problem*: Zewnetrzne faktory narzucaja zmiane kontekstu.

source: *Reset*: Reset versagt auch, wenn unversionierte Änderungen vorliegen.
pl: *reset*: reset odmówi pracy, jeśli znajdzie niewersjonowane zmiany.

source: - *`git checkout`*: Lade einen alten Spielstand, aber wenn du weiterspielst, wird der Spielstand von den früher gesicherten Spielständen abweichen.
pl: - *`git checkout`*: Załadój stary stan, ale jeśli będziesz grał dalej, twój stan będzie się różnił od poprzednio zapamietanych.

source: - *`git reset --hard`*: Lade einen alten Stand und lösche alle Spielstände, die neuer sind als der jetzt geladene.
pl: - *`git reset --hard`*: załadój poprzedni stan i skasuj wszystkie stany które są nowsze niż teraz załadowany.

source: - Entferne 'Commits' durch das Löschen von Zeilen.
pl: - usuń 'commits' poprzez skasowanie lini.

source: - Ersetze `pick` mit: * `edit` um einen 'Commit' für 'amends' zu markieren.
pl: - zamień `pick` na: * `edit` by zaznaczyć 'commit' do 'amends'.

source: - Organisiere 'Commits' durch verschieben von Zeilen.
pl: - przeorganizuj 'commits' przesuwając linie.

source: - http://github.com/[http://github.com/] hostet Open-Source Projekte kostenlos und geschlossene Projekte gegen Gebühr.
pl: - http://github.com/[http://github.com/] hostuje projekty Open-Source darmowo a projekty zamknięte za opłatą.

source: - http://gitorious.org/[http://gitorious.org/] ist eine andere Git Hosting Seite, bevorzugt für Open-Source Projekte.
pl: - http://gitorious.org/[http://gitorious.org/] to następna strona hostingowa Gita, preferująca Projekty Open-Source.

source: - http://packages.debian.org/gitmagic[Debian Packet], http:://packages.ubuntu.com/gitmagic[Ubuntu Packet]: Für eine schnelle und lokale Kopie dieser Seite.
pl: - http://packages.debian.org/gitmagic[Pakiet Debiana], http:://packages.ubuntu.com/gitmagic[Pakiet Ubuntu]: Dla szybkiej lokalnej kopii tej strony.

source: - http://repo.or.cz/[http://repo.or.cz/] hostet freie Projekte.
pl: - http://repo.or.cz/[http://repo.or.cz/] hostuje wolne projekty>

source: - http://www.amazon.com/Git-Magic-Ben-Lynn/dp/1451523343/[Gedrucktes Buch [Amazon.com]]: 64 Seiten, 15.24cm x 22.86cm, schwarz/weiß.
pl: - http://www.amazon.com/Git-Magic-Ben-Lynn/dp/1451523343/[Drukowana książka [Amazon.com]]: 64 Strony, 15.24cm x 22.86cm, czarno-biała.

source: - http://www.slideshare.net/slide_user/magia-git[Portugiesisch]: von Leonardo Siqueira Rodrigues [http://www.slideshare.net/slide_user/magia-git-verso-odt[ODT-Version]].
pl: - http://www.slideshare.net/slide_user/magia-git[portugalski]: od Leonardo Siqueira Rodrigues [http://www.slideshare.net/slide_user/magia-git-verso-odt[Wersja ODT]].

source: - link:/\~blynn/gitmagic/intl/zh_cn/[Vereinfachtes Chinesisch]: von JunJie, Meng und JiangWei.
pl: - link:/\~blynn/gitmagic/intl/zh_cn/[uproszczony chiński]: od JunJie, Meng i JiangWei.

source: - link:/~blynn/gitmagic/intl/de/[Deutsch]: von Benjamin Bellee und Armin Stebich; Auch gehostet unter http://gitmagic.lordofbikes.de/[Armin's Website].
pl: - link:/~blynn/gitmagic/intl/de/[Deutsch]: od Benjamin Bellee i Armin Stebich; Również na http://gitmagic.lordofbikes.de/[Armin's Website].

source: - link:/~blynn/gitmagic/intl/es/[Spanisch]: von Rodrigo Toledo und Ariset Llerena Tapia.
pl: - link:/~blynn/gitmagic/intl/es/[hiszpański]: od Rodrigo Toledo i Ariset Llerena Tapia.

source: - link:/~blynn/gitmagic/intl/fr/[Französich]: von Alexandre Garel, Paul Gaborit, und Nicolas Deram. Auch gehostet unter http://tutoriels.itaapy.com/[itaapy].
pl: - link:/~blynn/gitmagic/intl/fr/[francuski]: od Alexandre Garel, Paul Gaborit, i Nicolas Deram. Również na http://tutoriels.itaapy.com/[itaapy].

source: - link:/~blynn/gitmagic/intl/ru/[Russisch]: von Tikhon Tarnavsky, Mikhail Dymskov, und anderen.
pl: - link:/~blynn/gitmagic/intl/ru/[rosyjski]: od Tikhon Tarnavsky, Mikhail Dymskov, i innych.

source: - link:/~blynn/gitmagic/intl/vi/[Vietnamesisch]: von Trần Ngọc Quân; Auch gehostet unter http://vnwildman.users.sourceforge.net/gitmagic.html[seiner Website].
pl: - link:/~blynn/gitmagic/intl/vi/[wietnamski]: od Trần Ngọc Quân; Również na http://vnwildman.users.sourceforge.net/gitmagic.html[jego Stronie].

source: - link:book.html[Einzelne Webseite]: reines HTML, ohne CSS. - link:book.pdf[PDF Datei]: druckerfreundlich.
pl: - link:book.html[pojedyńcze strony]: czysty HTML, bez CSS. - link:book.pdf[PDF Datei]: przyjazne do druku.

source: .Andere Ausgaben
pl: .Inne wydania

source: .Kostenloses Git Hosting
pl: .Darmowe repozytoria Git

source: .Übersetzungen
pl: .Tłumaczenia

source: <<branch,Dazu kommen wir später>>.
pl: <<branch, wrócimy do tego później>>

source: = Git Magic = Ben Lynn August 2007
pl: = Git Magic = Ben Lynn Sierpień 2007

source: A, B, C, D sind 4 aufeinander folgende 'Commits'.
pl: A, B, C i D sa 4 nastepujacymi po sobie COMMITS.

source: Ab jetzt, immer wenn dein Skript reif für eine Veröffentlichung ist:
pl: Od teraz, zawsze gdy uznasz, że twój skrypt nadaje sie do opublikowania, wykonaj polecenie:

source: Aber auch wenn wir ein normales 'Repository' auf dem zentralen Server halten würden, wäre das 'pullen' eine mühselige Angelegenheit.
pl: Również gdybyśmy nawet używali normalnego REPOSITORY na serwerze centralnym, polecenie PULL stanowiłoby żmudną sprawę.

source: Aber deshalb ein einfacheres, schlecht erweiterbares System zu benutzen, ist wie römische Ziffern zum Rechnen mit kleinen Zahlen zu verwenden.
pl: Ale, by z tego powodu korzystać z prostego systemu, nie posiadającego możliwości rozszerzenia, to tak jak stosowanie rzymskich cyfr do przeprowadzania obliczeń na małych liczbach.

source: Aber du bist mit der Art der Organisation nicht glücklich und einige 'Commits' könnten etwas umformuliert werden.
pl: Nie jesteś jednak szczęśliwy z takiego zorganizowania a niektóre z 'commits' mogłyby być inaczej sformuowane.

source: Aber einige Leute sind diesen Zähler gewöhnt.
pl: Niektórzy jednak przyzwyczaili się do tego licznika.

source: Aber es gibt einen viel einfacheren Weg.
pl: Istnieje jednak dużo prostszy sposób.

source: Aber es ist eine Illusion.
pl: Ale to iluzja.

source: Aber manchmal arbeite ich an meinem Laptop, dann an meinem Desktop-PC und die beiden haben sich inzwischen nicht austauschen können.
pl: Jednak czasami pracuję na laptopie, później na desktopie, w międzyczasie nie nastąpiła miedzy nimi synchronizacja

source: Aber nun ist die Chronik in deinem lokalen Git-'Clone' ein chaotisches Durcheinander deiner Änderungen und den Änderungen vom offiziellen Zweig.
pl: Teraz jednak historia w twoim lokalnym klonie jest chaotychnym pomieszaniem twoich zmian i zmian z oficjalnego drzewa.

source: Aber spätere 'Commits' werden immer mindestens eine Zeile enthalten, die den Eltern-'Commit' identifiziert.
pl: Następujące 'commits' będą zawsze zawierać przynajmniej jedną linikę identyfikującą rodzica.

source: Aber stell Dir vor, Du hast ihn niemals notiert?
pl: Wyobraź jednak sobie, że nigdy go nie notowałeś?

source: Aber was, wenn wir nur deren Änderungen vergleichen wollen, ohne unsere eigene Arbeit zu beeinflussen?
pl: Co jednak zrobić, gdy chcemy porównać zmiany w nich bez wpływu na naszą pracę?

source: Aber wenn sich Deine Dateien zwischen aufeinanderfolgenden Versionen gravierend ändern, dann wird zwangsläufig mit jedem 'Commit' Dein Verlauf um die Größe des gesamten Projekts wachsen.
pl: Ale jeśli twoje dane znacznie się od siebie różnią pomiędzy następującymi po sobie wersjami, to chcąc nie chcąc przy każdym 'commit' projekt zwiększy się o twoje zmiany.

source: Aber wie kannst Du zurück in die Zukunft?
pl: Ale jak teraz wrócić znów do przyszłości?

source: Aber wo sind die Dateinamen?
pl: Gdzie są więc nazwy plików?

source: Aber, das überschreibt die vorherige Version.
pl: Jednak, przepisze to poprzednią wersję.

source: Aber, wenn du an der Vergangenheit manipulierst, sei vorsichtig: verändere nur den Teil der Chronik, den du ganz alleine hast.
pl: Ale jeśli masz zamiar manipulować przeszłpścią, bądź ostrożny: zmieniaj tylko tą część historii, którą wyłącznie jedynie ty sam posiadasz.

source: Aber, wenn man weiß was man tut, kann man die Schutzmaßnahmen der häufigsten Anweisungen umgehen.
pl: Ale, jeśli wiemy co robić, możemy obejść środki ochrony najczęściej stosowanych poleceń.

source: Aber, wie bei Zeitreisen in einem Science-Fiction-Film, wenn du jetzt etwas änderst und 'commitest', gelangst du in ein alternative Realität, denn deine Änderungen sind anders als beim früheren 'Commit'.
pl: Ale, tak samo jak w filmach science-fiction o podróżach w czasie, jeśli teraz dokonasz zmian i zapamietsz je poleceniem commit, przeniesiesz się do innej rzeczywostosci, ponieważ twoje zmiany różnią sie od dokonanych wcześniej.

source: Abgesehen von gelegentlichen 'Commits' und 'Merges' kannst Du arbeiten, als würde die Versionsverwaltung nicht existieren.
pl: Zapominając na chwilę o sporadycznych 'commits' i 'merges', możesz pracować w sposób, jakby kontrola wersji wogóle nie istniała.

source: Achte darauf, nicht die Option *-a* einzusetzen, anderenfalls wird Git alle Änderungen 'comitten'.
pl: Uważaj tylko, by nie skorzystać z opcji *-a*, ponieważ wtedy git dokona 'commit' zawierający wszystkie zmiany.

source: Aktualisiere das lokale 'Repository' erneut mit 'pull', löse eventuell aufgetretene 'Merge'-Konflikte und versuche es nochmal.
pl: Zaktualizuj lokalne REPOSITORY ponownie poleceniem PULL, pozbądź się konfliktów i spróbuj jeszcze raz

source: Alles, was man mit dem zentralen 'Repository' tun kann, kannst du auch mit deinem 'Clone' tun.
pl: Wszystko, co można zwobić z centralnym REPOSITORY, możesz również zrobić z klonem.

source: Allgemein gilt: Wenn du unsicher bist, egal ob ein Git Befehl oder irgendeine andere Operation, führe zuerst *git commit -a* aus.
pl: Ogólnia zasadą powinno być, że gdy nie jesteś pewien, obojętnie czy to jest polecenie GIT czy jakakolwiek inna operacja. wykonaj zawsze *git commit -a*.

source: Allgemein, *filter-branch* lässt dich große Bereiche der Chronik mit einer einzigen Anweisung verändern.
pl: Ogólnie poprzez *filter-branch* da się dokonać zmian w dużych zakresach historii poprzez tylko jedno polecenie.

source: Also 'commite' früh und oft: du kannst später mit 'rebase' aufräumen.
pl: A więc, stosuj polecenie 'commit' wcześnie i często: możesz później posprzątać za pomocą 'rebase'.

source: Alternativ kannst Du *git commit \--interactive* verwenden, was dann automatisch die ausgewählten Änderungen 'commited' nachdem Du fertig bist.
pl: Alternaywnie możesz skorzystać z *git commit \--interactive*, polecenie to wykona automatycznie 'commit' gdy skończysz.

source: Alternativ kannst du einen Webserver installieren mit *git instaweb*, dann kannst du mit jedem Webbrowser darauf zugreifen.
pl: Alternatywnie mozesz zaiinstalowac serwer http za pomoca *git instaweb*, wtedy mozesz przegladac kazda przegladarka.

source: Am schrecklichsten sind fehlende Dateien wegen eines vergessenen *git add*.
pl: Najbardziej fatalny jest brak plików spowodu zapomnianych *git add*.

source: Am wichtigsten ist, dass alle Operationen bis zu einem gewissen Grad langsamer sind, in der Regel bis zu dem Punkt, wo Anwender erweiterte Anweisungen scheuen, bis sie absolut notwendig sind.
pl: Najważniejsze jednak, że po z czasem wszystkie operacje stają się wolniejsze, z regóły do osiągnięcia punktu, gdzie użytkownicy unikają dodatkowych poleceń, aż staną się one absolutnie konieczne.

source: Andere Versionsverwaltungssysteme zwingen Dich ständig Dich mit Verwaltungskram und Bürokratie herumzuschlagen.
pl: Inne systemy kontroli wersji ciągle zmuszają cię do ciągłego borykania się z zagadnieniem samej kontroli i związanej z tym biurokracji.

source: Andere bestehen auf dem anderen Extrem: mehrere Fenster, ganz ohne Tabs.
pl: Inni upierają się przy tym: więcej okien, zupełnie bez tabs.

source: Andere denken, daß Zweige vorzeigbar gemacht werden sollten, bevor sie auf die Öffentlichkeit losgelassen werden.
pl: Inni uważają, ze odgałęzienia powinny dobrze się prezenotować nim zostaną przedstawione publicznie.

source: Andere können davon ausgehen, dass dein 'Repository' einen 'Branch' mit diesem Namen hat und dass er die offizielle Version enthält.
pl: Inni mogą wychodzić z założenia, że twój REPOSITORY posiada BRANCH o tej nazwie i że posiada on oficjalną wersję

source: Andere mögliche Dateitypen sind ausführbare Programmdateien, symbolische Links oder Verzeichnisse.
pl: Inne możliwe rodzaje plików to programy, linki symboliczne i katalogi.

source: Anderenfalls, sieh dir *git fast-import* an, das Text in einem speziellen Format einliest um eine Git Chronik von Anfang an zu erstellen.
pl: W innym razie przyjrzyj się funkcji *git fast-import*, która wczytuje tekst w specjalnym formacie by następnie odtworzyć całą historię od początku.

source: Anders als bei 'checkout' und 'reset' verschieben diese beiden Anweisungen das Zerstören der Daten.
pl: Inaczej niż w przypadku 'checkout' i 'reset', te oba polecenia przesuną zniszczenie danych.
